---
title: RoofBase
classe: Autodesk.Revit.DB.RoofBase
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.HostObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# RoofBase

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `EaveCutterType EaveCuts { get; set; }` | `roofBase.EaveCuts` | EaveCutterType |
| `Double FasciaDepth { get; set; }` | `roofBase.FasciaDepth` | Double |
| `RoofType RoofType { get; set; }` | `roofBase.RoofType` | RoofType |
| `SlabShapeEditor SlabShapeEditor { get; }` | `roofBase.SlabShapeEditor` | SlabShapeEditor |
| `SlabShapeEditor GetSlabShapeEditor()` | `roofBase.GetSlabShapeEditor()` | SlabShapeEditor |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```